In [44]:
%run "../utils/ema.py"

In [4]:
import quantrocket.master
import pandas as pd, numpy as np
import math
from quantrocket import get_prices
from collections import defaultdict

In [5]:
df_prices = get_prices("usstock-1d", universes="usstock", start_date="2017-01-01", fields=["Close"])

In [24]:
df_prices = df_prices.dropna(axis=1, thresh=100)
df_prices = df_prices.dropna(axis=1, thresh=1000)

In [38]:
df_close = df_prices.loc["Close"]

In [7]:
sid = 'FIBBG000C2V3D6'

In [40]:
df_sid = df_close[[sid]]

In [45]:
df_ema = get_df_ema(df_sid, alpha=0.3)

In [46]:
df_ama, df_h, df_l = get_df_ama(df_sid, alpha_min=0.3, alpha_max=0.7, beta=0.5, gamma=0.5)

In [34]:
df_h

Sid         FIBBG000C2V3D6
Date
2017-01-03        0.000000
2017-01-04       44.541900
2017-01-05       44.462488
2017-01-06       45.155319
2017-01-09       45.658553
...                    ...
2023-02-16      150.721639
2023-02-17      150.275121
2023-02-21             NaN
2023-02-22             NaN
2023-02-23             NaN

[1546 rows x 1 columns]

In [49]:
longs = (df_sid >= df_h)
shorts = (df_sid <= df_l)

longs = longs.astype(int)
shorts = -shorts.astype(int)

In [47]:
df_sid

Sid         FIBBG000C2V3D6
Date
2017-01-03          44.367
2017-01-04          44.950
2017-01-05          44.415
2017-01-06          45.799
2017-01-09          45.942
...                    ...
2023-02-16         148.280
2023-02-17         148.260
2023-02-21             NaN
2023-02-22             NaN
2023-02-23             NaN

[1546 rows x 1 columns]

In [48]:
(df_sid >= df_h)

Sid         FIBBG000C2V3D6
Date
2017-01-03            True
2017-01-04            True
2017-01-05           False
2017-01-06            True
2017-01-09            True
...                    ...
2023-02-16           False
2023-02-17           False
2023-02-21           False
2023-02-22           False
2023-02-23           False

[1546 rows x 1 columns]